<h1 align='center'>  <font size = '6' color='red'>    Data Analysis and Visualization  <font> </h1>


<br>
<center><h2> <center> <font color='green'> CHAPTER 4: Data Gathering and Cleaning
 <font> </h2> </center>
<br>
  
        
<div>
<img src="attachment:AIU.png" width="200"/>
</div>

    
<br>
<!-- <center align="left"> Developed for the MSc Program in Data Science  </center> -->
 
<center align="left"> Ala-too International University </center>
    
<center align="left">    <center align="left"><center align="left"> <font color='dark blue'><font style= 'bold' size='3' color='dark'>  Instructor: Mrs. Mekia Shigute GASO <font> </center>

In the 21st century, data is vital for decision-making and developing
long- term strategic plans. Python provides numerous libraries and built-
in features that make it easy to support data analysis and processing.
Making business decisions, forecasting weather, studying protein
structures in biology, and designing a marketing campaign are all
examples that require collecting data and then cleaning, processing, and
visualizing it.

**There are five main steps for processing scientific data.**

1. Data acquisition is where you read data
from various sources of unstructured data,
semistructured data, or full-structured data that
might be stored in a spreadsheet, comma-separated
file, web page, database, etc.
2. Data cleaning is where you remove noisy data and
make operations needed to keep only the relevant
data.
3. Exploratory analysis is where you look at your
cleaned data and make statistical processing fits for
specific analysis purposes.
4. An analysis model needs to be created. Advanced
tools such as machine learning algorithms can be
used in this step.
5. Data visualization is where the results are plotted
using various systems provided by Python to help in
the decision-making process.

**Python provides several libraries for data gathering, cleaning,
integration, processing, and visualizing.**

* Pandas is an open source Python library used to load,
organize, manipulate, model, and analyze data by
offering powerful data structures.
* Numpy is a Python package that stands for “numerical
Python. It is a library consisting of multidimensional
array objects and a collection of routines for manipulating
arrays. It can be used to perform mathematical, logical,
and linear algebra operations on arrays.
* SciPy is another built-in Python library for numerical
integration and optimization.
* Matplotlib is a Python library used to create 2D graphs
and plots. It supports a wide variety of graphs and plots
such as histograms, bar charts, power spectra, error charts,
and so on, with additional formatting such as control line
styles, font properties, formatting axes, and more.

# Cleaning Data

* Data is collected and entered manually or automatically using various
methods such as weather sensors, financial stock market data servers,
users’ online commercial preferences, etc. 
* Collected data is not error- free and usually has various missing data points and
erroneously entered data. 
* For instance, online users might not want
to enter their information because of privacy concerns. 
* Therefore,
treating missing and noisy data (NA or NaN) is important for any data
analysis processing.

## Checking for Missing Values

You can use built-in Python methods to check for missing values. Let’s
create a data frame using the Numpy and Pandas libraries. Include the
index values a to h, and give the columns labels of stock1, stock2, and
stock3, as shown below

In [80]:
#Creating a Data Frame Including NaN
import pandas as pd
import numpy as np
dataset = pd.DataFrame(np.random.randn(5, 3),
index=['a', 'c', 'e', 'f', 'h'],columns=['stock1',
'stock2', 'stock3'])
dataset.rename(columns={"one":'stock1',"two":'stock2',
"three":'stock3'}, inplace=True)
dataset = dataset.reindex(['a', 'b', 'c', 'd', 'e',
'f', 'g', 'h'])
print (dataset)

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b       NaN       NaN       NaN
c  0.749834  0.795085  1.158690
d       NaN       NaN       NaN
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g       NaN       NaN       NaN
h -0.426977 -0.488099 -1.194801

It should be clear that you can use Numpy to create an array of random
values, as shown below

In [81]:
# Creating a Matrix of Random Values
import numpy as np
np.random.randn(5, 3)

array([[-0.11705526, -0.66296375, -0.05655639],
       [ 1.31103524, -0.31092038, -1.55053489],
       [-0.39753443, -0.29987995,  0.94712659],
       [-2.73519951, -0.40741198,  0.33399012],
       [ 0.03409659, -0.71951953, -0.8903421 ]])

**In the first code, you are ignoring rows b, d, and g.** That’s why you got
NaN, which means non-numeric values. 
* Pandas provides the isnull()
and notnull() functions to detect the missing values in a data set. 
* A
Boolean value is returned when NaN has been detected; otherwise, False is
returned, as shown below

In [82]:
# Checking Null Case
print (dataset['stock1'].isnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: stock1, dtype: bool

# Handling the Missing Values

There are various techniques that can be used to handle missing values.
* You can replace NaN with a scalar value.
* For example code given below replaces all NaN cases with 0 values.

In [83]:
#Replacing NaN with a Scalar Value
print (dataset)
dataset.fillna(0)

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b       NaN       NaN       NaN
c  0.749834  0.795085  1.158690
d       NaN       NaN       NaN
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g       NaN       NaN       NaN
h -0.426977 -0.488099 -1.194801

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b  0.000000  0.000000  0.000000
c  0.749834  0.795085  1.158690
d  0.000000  0.000000  0.000000
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g  0.000000  0.000000  0.000000
h -0.426977 -0.488099 -1.194801

**You can fill NaN cases forward and backward.**

* Another technique to handle missing values is to fill
them forward using pad/fill or fill them backward
using bfill/backfill methods. 
* Eg. the
values of row a are replicating the missing values in
row b as shown below:

In [84]:
#Filling In Missing Values Forward
# which means the next NAN will take the previouse value.
print (dataset)
dataset.fillna(method='pad')

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b       NaN       NaN       NaN
c  0.749834  0.795085  1.158690
d       NaN       NaN       NaN
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g       NaN       NaN       NaN
h -0.426977 -0.488099 -1.194801

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b  0.643928 -1.723605 -0.811122
c  0.749834  0.795085  1.158690
d  0.749834  0.795085  1.158690
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g -0.641983 -1.777661 -0.551883
h -0.426977 -0.488099 -1.194801

**You can drop the missing values.**

* Another technique is to exclude all the rows with
NaN values. 
* The Pandas dropna() function can be
used to drop entire rows from the data set. 
* As you
can see in eg. below, rows b, d, and g are removed
entirely from the data set.

In [85]:
#Dropping All NaN Rows
print (dataset)
dataset.dropna()

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b       NaN       NaN       NaN
c  0.749834  0.795085  1.158690
d       NaN       NaN       NaN
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g       NaN       NaN       NaN
h -0.426977 -0.488099 -1.194801

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
c  0.749834  0.795085  1.158690
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
h -0.426977 -0.488099 -1.194801

**You can replace the missing value/s specifically or generally.**

* The replace() method can be used to replace a
specific value in a data set with another given value.

* In addition, it can be used to replace NaN cases, as
shown below

In [86]:
# Using the replace() Function
print (dataset)
dataset.replace(np.nan, 0 )

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b       NaN       NaN       NaN
c  0.749834  0.795085  1.158690
d       NaN       NaN       NaN
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g       NaN       NaN       NaN
h -0.426977 -0.488099 -1.194801

     stock1    stock2    stock3
a  0.643928 -1.723605 -0.811122
b  0.000000  0.000000  0.000000
c  0.749834  0.795085  1.158690
d  0.000000  0.000000  0.000000
e -1.237252 -0.893028 -2.094970
f -0.641983 -1.777661 -0.551883
g  0.000000  0.000000  0.000000
h -0.426977 -0.488099 -1.194801

# Reading and Cleaning CSV Data

In this section, you will read data from a comma-separated values
(CSV) file.

You can access csv data for example from: https://stats.govt.nz/large-datasets/csv-files-for-download/

You can use the Pandas library to read a file and display the first five
records. An autogenerated index has been generated by Python starting
with 0, as shown below

**In what follows we use data of stock market with a file name AAPL.csv**

In [87]:
import pandas as pd
sales = pd.read_csv("AAPL.csv") #NOTE: PUT THE PATH OF THE FILE like /home/../.../file.csv if needed
print ("\n\n<<<<<<< First 5 records <<<<<<<\n\n" )
print (sales.head())

<<<<<<< First 5 records <<<<<<<


         Date    Open    High     Low   Close    Volume  Adj Close
0  2008-10-14  116.26  116.40  103.14  104.08  70749800     104.08
1  2008-10-13  104.55  110.53  101.02  110.26  54967000     110.26
2  2008-10-10   85.70  100.00   85.00   96.80  79260700      96.80
3  2008-10-09   93.35   95.80   86.60   88.74  57763700      88.74
4  2008-10-08   85.91   96.33   85.68   89.79  78847900      89.79

In [88]:
#You can display the last five records using the tail() method.
print (sales.tail())

            Date   Open   High    Low  Close   Volume  Adj Close
6076  1984-09-13  27.50  27.62  27.50  27.50  7429600       3.14
6077  1984-09-12  26.87  27.00  26.12  26.12  4773600       2.98
6078  1984-09-11  26.62  27.37  26.62  26.87  5444000       3.07
6079  1984-09-10  26.50  26.62  25.87  26.37  2346400       3.01
6080  1984-09-07  26.50  26.87  26.25  26.50  2981600       3.02

pd.read_csv() is used to read the entire CSV file; sometimes you need
to read only a few records to reduce memory usage, though. In that case,
you can use the nrows attribute to control the number of rows you want to
read.

In [6]:
import pandas as pd
salesNrows = pd.read_csv("AAPL.csv", nrows=4)
salesNrows

         Date    Open    High     Low   Close    Volume  Adj Close
0  2008-10-14  116.26  116.40  103.14  104.08  70749800     104.08
1  2008-10-13  104.55  110.53  101.02  110.26  54967000     110.26
2  2008-10-10   85.70  100.00   85.00   96.80  79260700      96.80
3  2008-10-09   93.35   95.80   86.60   88.74  57763700      88.74

Similarly, you can read specific columns using a column index or label.
Eg below reads columns 0, 1, and 6 using the usecols attribute and then
uses the column labels instead of the column indices.

In [90]:
salesNrows = pd.read_csv("AAPL.csv", nrows=4,
usecols=[0, 1, 6])
salesNrows

         Date    Open  Adj Close
0  2008-10-14  116.26     104.08
1  2008-10-13  104.55     110.26
2  2008-10-10   85.70      96.80
3  2008-10-09   93.35      88.74

In [91]:
salesNrows = pd.read_csv("AAPL.csv", nrows=4,
usecols=["Date","Open","Close","Volume"])
salesNrows

         Date    Open   Close    Volume
0  2008-10-14  116.26  104.08  70749800
1  2008-10-13  104.55  110.26  54967000
2  2008-10-10   85.70   96.80  79260700
3  2008-10-09   93.35   88.74  57763700

### Let us now read a new data called RD_survey.csv and rename some of its columns

In [10]:
RD = pd.read_csv("RD_survey.csv")
RD.head()

,Variable,Breakdown,Breakdown_category,Year,RD_Value,Status,Footnotes,Unit_for_TSM_and_CSV
0,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2016,91,NaN,12,NZ Dollars (millions)
1,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2018,89,NaN,12,NZ Dollars (millions)
2,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2019,...,NaN,12,NZ Dollars (millions)
3,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2020,99,P,12,NZ Dollars (millions)
4,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2021,...,NaN,12,NZ Dollars (millions)

In [9]:
# to get more detailed infromation about the data we are reading we use .info() as in:
RD.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27663 entries, 0 to 27662
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Variable              27663 non-null  object
 1   Breakdown             27663 non-null  object
 2   Breakdown_category    27663 non-null  object
 3   Year                  27663 non-null  int64
 4   RD_Value              27663 non-null  object
 5   Status                1427 non-null   object
 6   Footnotes             26810 non-null  object
 7   Unit_for_TSM_and_CSV  27663 non-null  object
dtypes: int64(1), object(7)
memory usage: 1.7+ MB

In the following, the .rename() method is used to change data set
column labels (e.g., Breakdown_category changed to Category). In addition, you set
inplace=True to commit these changes to the original data set, not to a
copy of it.

In [16]:
# we used nrows attribute to control the number of rows we want to read, in this case for eg. we have 8
RD_Nrows = pd.read_csv("RD_survey.csv", nrows=8)
RD_Nrows

,Variable,Breakdown,Breakdown_category,Year,RD_Value,Status,Footnotes,Unit_for_TSM_and_CSV
0,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2016,91,NaN,12,NZ Dollars (millions)
1,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2018,89,NaN,12,NZ Dollars (millions)
2,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2019,...,NaN,12,NZ Dollars (millions)
3,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2020,99,P,12,NZ Dollars (millions)
4,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2021,...,NaN,12,NZ Dollars (millions)
5,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2016,5,NaN,12,NZ Dollars (millions)
6,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2018,9,NaN,12,NZ Dollars (millions)
7,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2019,...,NaN,12,NZ Dollars (millions)

In [19]:
# here we are re-naming the two column as shown below: "Breakdown_category" will change to 'Category' and soon.
RD_Nrows.rename(columns={"Breakdown_category":'Category',"Unit_for_TSM_and_CSV":'TSM_CSV'}, inplace=True)
RD_Nrows

,Variable,Breakdown,Category,Year,RD_Value,Status,Footnotes,TSM_CSV
0,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2016,91,NaN,12,NZ Dollars (millions)
1,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2018,89,NaN,12,NZ Dollars (millions)
2,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2019,...,NaN,12,NZ Dollars (millions)
3,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2020,99,P,12,NZ Dollars (millions)
4,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2021,...,NaN,12,NZ Dollars (millions)
5,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2016,5,NaN,12,NZ Dollars (millions)
6,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2018,9,NaN,12,NZ Dollars (millions)
7,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2019,...,NaN,12,NZ Dollars (millions)

#### You can find the unique values in your data set variables; you just refer to each column as a variable or pattern that can be used for further processing.

In [22]:
#Finding Unique Values in Columns
print (len(RD_Nrows['Status'].unique()))
print (len(RD_Nrows['RD_Value'].unique()))
print (RD_Nrows['Status'].unique())

2
6
[nan 'P']

#### To get precise data, you can replace all values that are anomalies with NaN for further processing. For example, as shown in below, you can use na_values =["n.a.", "not avilable", -1] to generate NaN cases while you are reading the CSV file.

In [23]:
#Automatically Replacing Matched Cases with NaN
import pandas as pd
RD = pd.read_csv("RD_survey.csv", nrows=7, na_values=["n.a.", "not avilable"])
mydata = RD.head(7)
mydata

,Variable,Breakdown,Breakdown_category,Year,RD_Value,Status,Footnotes,Unit_for_TSM_and_CSV
0,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2016,91,NaN,12,NZ Dollars (millions)
1,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2018,89,NaN,12,NZ Dollars (millions)
2,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2019,...,NaN,12,NZ Dollars (millions)
3,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2020,99,P,12,NZ Dollars (millions)
4,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2021,...,NaN,12,NZ Dollars (millions)
5,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2016,5,NaN,12,NZ Dollars (millions)
6,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2018,9,NaN,12,NZ Dollars (millions)

#### Let us also for example replace -1, or any value which doesn't make sense to you, to NAN in that case we should also include it in na_values as in below

In [24]:
#Automatically Replacing Matched Cases with NaN
import pandas as pd
RD = pd.read_csv("RD_survey.csv", nrows=7, na_values=["n.a.", "not avilable", -1])
mydata = RD.head(7)
mydata

,Variable,Breakdown,Breakdown_category,Year,RD_Value,Status,Footnotes,Unit_for_TSM_and_CSV
0,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2016,91,NaN,12,NZ Dollars (millions)
1,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2018,89,NaN,12,NZ Dollars (millions)
2,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2019,...,NaN,12,NZ Dollars (millions)
3,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2020,99,P,12,NZ Dollars (millions)
4,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,"A_Agriculture, Forestry and Fishing",2021,...,NaN,12,NZ Dollars (millions)
5,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2016,5,NaN,12,NZ Dollars (millions)
6,_01_Current_and_Capital_Expenditure:_Total_RD_...,ANZSIC_1_Digit,B_Mining,2018,9,NaN,12,NZ Dollars (millions)

# Merging and Integrating Data

Python provides the merge() method to merge different data sets together
using a specific common pattern. The following egs. reads two different data sets
about export values not necessarly a real one, just for the sake of example, in a different range of years but for the same countries.

In [52]:
import pandas as pd
a = pd.read_csv("export_data1.csv")
a

   Country Name  Country Code   2004   2005   2006   2007
0         Benin           BEN    811    940    869   1076
1  Burkina Faso           BFA    548    532     73    714
2    Bangladesh           BGD   7257   9995  11745  13530
3      Bulgaria           BGR  10713  12703  16151  23263
4       Bahrain           BHR  10337  13397  15662  17314

In [41]:
b = pd.read_csv("export_data2.csv")
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country Name   5 non-null      object
 1    Country Code  5 non-null      object
 2    2008          5 non-null      int64
 3    2009          5 non-null      int64
 4    2010          5 non-null      int64
 5    2011          5 non-null      int64
 6    2012          5 non-null      int64
 7    2013          5 non-null      int64
 8    2014          5 non-null      int64
dtypes: int64(7), object(2)
memory usage: 488.0+ bytes

In [ ]:
Suppose that you want to drop specific years from this study such as
2009, 2012 and 2014. Let us demonstrate
different methods that are used to drop these columns:

In [58]:
Stock = pd.read_csv("AAPL.csv")

Stock

            Date    Open    High     Low   Close    Volume  Adj Close
0     2008-10-14  116.26  116.40  103.14  104.08  70749800     104.08
1     2008-10-13  104.55  110.53  101.02  110.26  54967000     110.26
2     2008-10-10   85.70  100.00   85.00   96.80  79260700      96.80
3     2008-10-09   93.35   95.80   86.60   88.74  57763700      88.74
4     2008-10-08   85.91   96.33   85.68   89.79  78847900      89.79
...          ...     ...     ...     ...     ...       ...        ...
6076  1984-09-13   27.50   27.62   27.50   27.50   7429600       3.14
6077  1984-09-12   26.87   27.00   26.12   26.12   4773600       2.98
6078  1984-09-11   26.62   27.37   26.62   26.87   5444000       3.07
6079  1984-09-10   26.50   26.62   25.87   26.37   2346400       3.01
6080  1984-09-07   26.50   26.87   26.25   26.50   2981600       3.02

[6081 rows x 7 columns]

In [59]:
# Here we are for eg. droping the columns: 'Date', 'Adj Close']
columns = ['Date', 'Adj Close']
Stock.drop(columns, inplace=True, axis=1)
Stock.head()

     Open    High     Low   Close    Volume
0  116.26  116.40  103.14  104.08  70749800
1  104.55  110.53  101.02  110.26  54967000
2   85.70  100.00   85.00   96.80  79260700
3   93.35   95.80   86.60   88.74  57763700
4   85.91   96.33   85.68   89.79  78847900


## Not let us get back to merging the two datas "export_data1.csv" and "export_data2.csv" given below:

In [57]:
a = pd.read_csv("export_data2.csv")
a

   Country Name  Country Code   2008   2009   2010   2011   2012   2013   2014
0         Benin           BEN   1312   1039    991   1040   1154   1518   1656
1  Burkina Faso           BFA    834    532     73    714   9995  11745  13530
2    Bangladesh           BGD  16181   9995  11745  13530  22853      0      0
3      Bulgaria           BGR  28591  12703    548    532  16151  23263  34344
4       Bahrain           BHR  21231  13397  15662  17314   1154   1518  17314

In [56]:
b = pd.read_csv("export_data2.csv")
b

   Country Name  Country Code   2008   2009   2010   2011   2012   2013   2014
0         Benin           BEN   1312   1039    991   1040   1154   1518   1656
1  Burkina Faso           BFA    834    532     73    714   9995  11745  13530
2    Bangladesh           BGD  16181   9995  11745  13530  22853      0      0
3      Bulgaria           BGR  28591  12703    548    532  16151  23263  34344
4       Bahrain           BHR  21231  13397  15662  17314   1154   1518  17314

## We can see that the two datas "export_data1.csv" and "export_data2.csv" can easly be merged as in below:

In [54]:
mergedDataSet = a.merge(b, on="Country Name")
mergedDataSet.head()

,Country Name,Country Code_x,2004,2005,2006,2007,Country Code_y,2008,2009,2010,2011,2012,2013,2014
0,Benin,BEN,811,940,869,1076,BEN,1312,1039,991,1040,1154,1518,1656
1,Burkina Faso,BFA,548,532,73,714,BFA,834,532,73,714,9995,11745,13530
2,Bangladesh,BGD,7257,9995,11745,13530,BGD,16181,9995,11745,13530,22853,0,0
3,Bulgaria,BGR,10713,12703,16151,23263,BGR,28591,12703,548,532,16151,23263,34344
4,Bahrain,BHR,10337,13397,15662,17314,BHR,21231,13397,15662,17314,1154,1518,17314

#### In the above we observe that python authomaticaly Merge two datasets using column labeled Country Code_x and CountryCode_y.

In [61]:
dataX = a.merge(b)
dataX.head()

   Country Name  Country Code   2008   2009   2010   2011   2012   2013   2014
0         Benin           BEN   1312   1039    991   1040   1154   1518   1656
1  Burkina Faso           BFA    834    532     73    714   9995  11745  13530
2    Bangladesh           BGD  16181   9995  11745  13530  22853      0      0
3      Bulgaria           BGR  28591  12703    548    532  16151  23263  34344
4       Bahrain           BHR  21231  13397  15662  17314   1154   1518  17314

## Home Work [1]

#### Merge two data sets using Index via Rows Union operation, where the .concat() method is used to merge Data1 and Data2 over axis 0. This is a row-wise operation.

# Reading Data from the JSON Format

In python you can read also data other than csv. The Pandas library can read JSON files using the read_json function directly from the cloud or from a hard disk. One can create a JSON data and load it in JSON format and then iterate or manipulate the data.

#### The JSON format is similar to a dictionary structure where you have a key-value pair, but in JSON, you can have subattributes with inner values, similar to email in the first example, and its subattribute hide with the value NO.

In [19]:
#Creating and Manipulating JSON Data
import json 
data = '''{
"name" : "Mekia",
"phone" : { "type" : "intl", "number" : "+996 12 345 6677"},
"email" : {"hide" : "No" }
}'''

In [7]:
info = json.loads(data)
print ('Name:',info["name"])
print ('Hide:',info["email"]["hide"])

Name: Mekia
Hide: No

In [15]:
input = '''[
{ "id" : "001", "x" : "7", "name" : "Fahmi"} ,
{ "id" : "002","x" : "6","name" : "Farida" }
]'''
info = json.loads(input) 
print ('User count:',
len(info)) 
for item in info:
    print ('\nName', item['name'])
    print ('Id', item['id'])
    print ('Attribute', item['x'])

User count: 2

Name Fahmi
Id 001
Attribute 7

Name Farida
Id 002
Attribute 6

### You can directly read JSON data from an online resource, as shown in below

In [17]:
import urllib.request

# Use urllib to concatenate an Url
myWebUrl = urllib.request.urlopen('http://python-data.dr-chuck.net/comments_244984.json')

# Get data from the Url of your choice
dataHTML = myWebUrl.read()
print(dataHTML)

b'{\n  "note":"This file contains the actual data for your assignment",\n  "comments":[\n    {\n      "name":"Abaan",\n      "count":98\n    },\n    {\n      "name":"Ashna",\n      "count":95\n    },\n    {\n      "name":"Dante",\n      "count":94\n    },\n    {\n      "name":"Isabel",\n      "count":93\n    },\n    {\n      "name":"Fearne",\n      "count":92\n    },\n    {\n      "name":"Kriss",\n      "count":91\n    },\n    {\n      "name":"Janani",\n      "count":87\n    },\n    {\n      "name":"Karhys",\n      "count":85\n    },\n    {\n      "name":"Megg",\n      "count":84\n    },\n    {\n      "name":"Luisa",\n      "count":83\n    },\n    {\n      "name":"Thorben",\n      "count":79\n    },\n    {\n      "name":"Kaelan",\n      "count":77\n    },\n    {\n      "name":"Ceirin",\n      "count":75\n    },\n    {\n      "name":"Lileidh",\n      "count":70\n    },\n    {\n      "name":"Angelika",\n      "count":70\n    },\n    {\n      "name":"Amelka",\n      "count":69\n    },\n    {\n      "name":"Justin",\n      "count":69\n    },\n    {\n      "name":"Muneeb",\n      "count":68\n    },\n    {\n      "name":"Antoine",\n      "count":64\n    },\n    {\n      "name":"Ivar",\n      "count":61\n    },\n    {\n      "name":"Kaid",\n      "count":60\n    },\n    {\n      "name":"Dakotah",\n      "count":58\n    },\n    {\n      "name":"Nadeem",\n      "count":58\n    },\n    {\n      "name":"Marybeth",\n      "count":55\n    },\n    {\n      "name":"Ashlyn",\n      "count":55\n    },\n    {\n      "name":"Kaydin",\n      "count":50\n    },\n    {\n      "name":"Obieluem",\n      "count":48\n    },\n    {\n      "name":"Cairn",\n      "count":46\n    },\n    {\n      "name":"Ala",\n      "count":45\n    },\n    {\n      "name":"Vithujan",\n      "count":38\n    },\n    {\n      "name":"Ivory",\n      "count":34\n    },\n    {\n      "name":"Rosalyn",\n      "count":33\n    },\n    {\n      "name":"Kaywan",\n      "count":32\n    },\n    {\n      "name":"Pedro",\n      "count":31\n    },\n    {\n      "name":"Bharath",\n      "count":30\n    },\n    {\n      "name":"Eshaal",\n      "count":29\n    },\n    {\n      "name":"Aliya",\n      "count":28\n    },\n    {\n      "name":"Sephiroth",\n      "count":27\n    },\n    {\n      "name":"Minah",\n      "count":25\n    },\n    {\n      "name":"Murdo",\n      "count":22\n    },\n    {\n      "name":"Ata",\n      "count":21\n    },\n    {\n      "name":"Remonae",\n      "count":17\n    },\n    {\n      "name":"Muskaan",\n      "count":17\n    },\n    {\n      "name":"Lottie",\n      "count":17\n    },\n    {\n      "name":"Giane",\n      "count":9\n    },\n    {\n      "name":"Dineo",\n      "count":6\n    },\n    {\n      "name":"Zoe",\n      "count":5\n    },\n    {\n      "name":"Raul",\n      "count":4\n    },\n    {\n      "name":"Tammylee",\n      "count":2\n    },\n    {\n      "name":"Morna",\n      "count":1\n    }\n  ]\n}'

# Loading a JSON File

In [93]:
import json
with open('commented.json') as json_data:
    JSONdta = json.load(json_data)
print(JSONdta)

{'note': 'This file contains the actual data for your assignment', 'comments': [{'name': 'Abaan', 'count': 98}, {'name': 'Ashna', 'count': 95}, {'name': 'Dante', 'count': 94}, {'name': 'Isabel', 'count': 93}, {'name': 'Fearne', 'count': 92}, {'name': 'Kriss', 'count': 91}, {'name': 'Janani', 'count': 87}, {'name': 'Karhys', 'count': 85}, {'name': 'Megg', 'count': 84}, {'name': 'Luisa', 'count': 83}, {'name': 'Thorben', 'count': 79}, {'name': 'Kaelan', 'count': 77}, {'name': 'Ceirin', 'count': 75}, {'name': 'Lileidh', 'count': 70}, {'name': 'Angelika', 'count': 70}, {'name': 'Amelka', 'count': 69}, {'name': 'Justin', 'count': 69}, {'name': 'Muneeb', 'count': 68}, {'name': 'Antoine', 'count': 64}, {'name': 'Ivar', 'count': 61}, {'name': 'Kaid', 'count': 60}, {'name': 'Dakotah', 'count': 58}, {'name': 'Nadeem', 'count': 58}, {'name': 'Marybeth', 'count': 55}, {'name': 'Ashlyn', 'count': 55}, {'name': 'Kaydin', 'count': 50}, {'name': 'Obieluem', 'count': 48}, {'name': 'Cairn', 'count': 46}, {'name': 'Ala', 'count': 45}, {'name': 'Vithujan', 'count': 38}, {'name': 'Ivory', 'count': 34}, {'name': 'Rosalyn', 'count': 33}, {'name': 'Kaywan', 'count': 32}, {'name': 'Pedro', 'count': 31}, {'name': 'Bharath', 'count': 30}, {'name': 'Eshaal', 'count': 29}, {'name': 'Aliya', 'count': 28}, {'name': 'Sephiroth', 'count': 27}, {'name': 'Minah', 'count': 25}, {'name': 'Murdo', 'count': 22}, {'name': 'Ata', 'count': 21}, {'name': 'Remonae', 'count': 17}, {'name': 'Muskaan', 'count': 17}, {'name': 'Lottie', 'count': 17}, {'name': 'Giane', 'count': 9}, {'name': 'Dineo', 'count': 6}, {'name': 'Zoe', 'count': 5}, {'name': 'Raul', 'count': 4}, {'name': 'Tammylee', 'count': 2}, {'name': 'Morna', 'count': 1}]}

### You can access JSON data and make further operations on the extracted data. For instance, you can calculate the total number of all users, find the average value of all counts, and more, as shown below

In [94]:
sumv=0
counter=0
for i in range(len(JSONdta["comments"])):
    counter+=1
    Name = JSONdta["comments"][i]["name"]
    Count = JSONdta["comments"][i]["count"]
    sumv+=int(Count)
print (Name," ", Count)
print ("\nCount: ", counter)
print ("Sum: ", sumv)

Morna   1

Count:  50
Sum:  2507

# Reading Data from the HTML Format

You can read online HTML files, but you should install and use the
Beautiful Soup package to do so. The following eg. shows how to make a request
to a URL to be loaded into the Python environment. Then you use the HTML parser parameter to read the entire HTML file. You can also extract values stored with HTML tags.

# Reading and Parsing an HTML File

In [54]:

from bs4 import BeautifulSoup as bs
import urllib

response = urllib.request.urlopen('http://python-data.dr-chuck.net/known_by_Rona.html')
html_doc = response.read()
soup = BeautifulSoup(html_doc, 'html.parser')
print(html_doc[:700])
print("\n")
print (soup.title)
print(soup.title.string)
print(soup.a.string)

b'<html>\n<head>\n<title>People that Rona knows</title>\n<style>\n.overlay{\n    opacity:0.99;\n    background-color:#eee;\n    position:fixed;\n    width:100%;\n    height:100%;\n    top:0px;\n    left:0px;\n    z-index:1000;\n}\n</style>\n</head>\n<body>\n<h1>People that Rona knows</h1>\n<div class="overlay" id="overlay" style="display:none" >\n<center>\n<h2>\nThis screen randomly changes the height between list items and vanishes \nafter a while to make sure that you retrieve and process the data\nin a Python program rather than simply counting down pressing links, and \ndoing the assignment without writing a Python program :).\nThe names are in the same order in the HTML even though they \nshift around on the scree'


<title>People that Rona knows</title>
People that Rona knows
Konar

In [72]:
import urllib.request
with urllib.request.urlopen("http://python-data.dr-chuck.net/known_by_Rona.html") as url:
    strhtml = url.read()
#I'm guessing this would output the html source code?
print(strhtml[:700])

b'<html>\n<head>\n<title>People that Rona knows</title>\n<style>\n.overlay{\n    opacity:0.99;\n    background-color:#eee;\n    position:fixed;\n    width:100%;\n    height:100%;\n    top:0px;\n    left:0px;\n    z-index:1000;\n}\n</style>\n</head>\n<body>\n<h1>People that Rona knows</h1>\n<div class="overlay" id="overlay" style="display:none" >\n<center>\n<h2>\nThis screen randomly changes the height between list items and vanishes \nafter a while to make sure that you retrieve and process the data\nin a Python program rather than simply counting down pressing links, and \ndoing the assignment without writing a Python program :).\nThe names are in the same order in the HTML even though they \nshift around on the scree'

### You can also load HTML and use the Beautiful Soup package to parse HTML tags and display the first ten anchor tags, as shown below

In [ ]:
#Parsing HTML Tags
response = urllib.request.urlopen("http://python-data.dr-chuck.net/known_by_Rona.html")
html_doc = response.read()
print (html_doc[:300])
soup = BeautifulSoup(html_doc, 'html.parser')
print ("\n") 
counter=0
for link in soup.findAll("a"):
    print(link.get("href"))
    if counter<10: counter+=1 
        continue
    else:
        break
        
#Exercise: FIX THIS CODE     IndentationError: unexpected indent

### Let’s create an html variable that maintains some web page content and read it using Beautiful Soup, as shown in

In [42]:
htmldata="""<html>
<head>
<title>
The Dormouse's story
</title>
</head>
<body>
<p class="title">
<b>
The Dormouse's story
</b>
</p>
<p class="story">
Once upon a time there were three little
sisters; and their names were
<a class="sister" href="http://example.com/
elsie" id="link1"> Elsie
</a>
,
<a class="sister" href="http://example.com/
lacie" id="link2"> Lacie
</a> and
<a class="sister" href="http://example.com/
tillie" id="link2"> Tillie
</a>
; and they lived at the bottom of a well.
</p>
<p class="story"> ...
</p>
</body>
</html>
"""

In [52]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(htmldata, 'html.parser')
print(soup.prettify())

<html>
 <head>
  <title>
   The Dormouse's story
  </title>
 </head>
 <body>
  <p class="title">
   <b>
    The Dormouse's story
   </b>
  </p>
  <p class="story">
   Once upon a time there were three little
sisters; and their names were
   <a class="sister" href="http://example.com/
elsie" id="link1">
    Elsie
   </a>
   ,
   <a class="sister" href="http://example.com/
lacie" id="link2">
    Lacie
   </a>
   and
   <a class="sister" href="http://example.com/
tillie" id="link2">
    Tillie
   </a>
   ; and they lived at the bottom of a well.
  </p>
  <p class="story">
   ...
  </p>
 </body>
</html>

### Another common task is extracting all the text from a page and ignoring all the tags, as shown below

In [53]:
print(soup.get_text())

The Dormouse's story





The Dormouse's story



Once upon a time there were three little
sisters; and their names were
 Elsie

,
 Lacie
 and
 Tillie

; and they lived at the bottom of a well.

 ...

# Reading XML and Extracting Its Data

In [ ]:
Python provides the xml.etree.ElementTree (ET) module to implement
a simple and efficient parsing of XML data. ET has two classes for this
purpose: ElementTree, which represents the whole XML document as a
tree, and Element, which represents a single node in this tree. Interactions
with the whole document (reading and writing to/from files) are usually
done on the ElementTree level. The interactions with a single XML element
and its subelements are done on the Element level.

In [ ]:
In eg. given below, you are creating an XML container and reading it using ET for parsing purposes.
Then you extract data from the container using the find() and get()
methods, parsing through the generated tree.

In [79]:
xmldata = """
<?xml version="1.0"?>
<data>
<student
name="Mustafa">
<rank>2</rank>
<year>2017</year>
<GPA>3.5</GPA>
<concentration name="Networking"
Semester="7"/> </student>
<student name="Ali">
<rank>3</rank>
<year>2016</year>
<GPA>2.8</GPA>
<concentration name="Security"
Semester="6"/>
</student>
<student name="Adilet">
<rank>1</rank>
<year>2018</year>
<GPA>3.7</GPA>
<concentration name="App Development"
Semester="8"/> </student>
</data>
""".strip()

In [80]:
from xml.etree import ElementTree as ET 
stuff = ET.fromstring(xmldata) 
lst = stuff.findall('student')
print ('Students count:', len(lst)) 
for item in lst:
    print ("\nName:", item.get("name"))
    print ('concentration:', item.find("concentration").get("name"))
    print ('Rank:', item.find('rank').text)
    print ('GPA:', item.find("GPA").text)

Students count: 3

Name: Mustafa
concentration: Networking
Rank: 2
GPA: 3.5

Name: Ali
concentration: Security
Rank: 3
GPA: 2.8

Name: Adilet
concentration: App Development
Rank: 1
GPA: 3.7

<h1 align='center'>  <font size = '6' color='blue'>    Problem Sets: perform the following tasks <font> </h1>


# 1. Write a Python script to read the data in an Excel file named movies.xlsx and save this data in a data frame called mov. Perform the following steps:
you may use the link: https://github.com/parulnith/Data-Visualisation-libraries/blob/master/Data%20Visualisation%20with%20Tableau/Wordclouds%20with%20Tableau/movies.xlsx

a) Read the contents of the second sheet that is named 2020s in the Excel file (movies.xlsx) and store this content in a data frame called Second_sheet.

please add manually the content of the second sheet for example top movies of the last 3 years
Note: Rename: Domestic Gross to Budget and Metacritic score to User Votes
b) Write the code needed to show the first seven rows from the data frame Second_sheet using an appropriate method.

c) Write the code needed to show the last five rows using an appropriate method.

d) Use a suitable command to show only one column that is named Budget.

e) Use a suitable command to show the total rows in the first sheet that is called 2000s.

f) Use a suitable command to show the maximum value stored in the Budget column.

g) Use a suitable command to show the minimum value stored in the Budget column

h) Write a single command to show the details (count, min, max, mean, std, 25%, 50%, 75%) about the column User Votes.

i) Use a suitable conditional statement that stores the rows in which the country name is USA and the Duration value is less than 50 in a data frame named USA50. Show the values in data frame USA50.

j) Using a suitable command, create a calculated column named Avg Reviews in Second_sheet by adding Reviews by Users and Reviews by Critics and divide it by 2. Display the first five rows of the Second_sheet after creating the previous calculated column.

k) Using a suitable command, sort the Country values in ascending order (smallest to largest) and Avg_reviews in descending order (largest to smallest).


# 2. Write a Python script to read the following HTML and extract and display only the content, ignoring the tag structure:

In [ ]:
<html>
<head>
<title>
Python Book Version 2018
</title>
</head>
<body>
<p class="title">
<b>
Author Name: Ossama Embarak
</b>
</p>
<p class="story">
Python techniques for gathering and cleaning data
<a class="sister" href="https://leanpub.com/
AgilePythonProgrammingAppliedForEveryone" id="link1">
Data Cleaning
</a>
, Data Processing and Visualization
<a class="sister" href="http://www.lulu.com/shop/ossama-
embarak/agile-python-programming-applied-for-everyone/
paperback/product-23694020.html" id="link2">
Data Visualization
</a>
</p>
<p class="story">
@July 2018
</p>
</body>
</html>

<h1 align='center'>  <font size = '6' color='red'>    Project Idea! <font> </h1>

An example: https://www.kaggle.com/code/fahaddalwai/movie-recommendation-system